[["OfferName: Amazon EMI Offer - 3, 6, 9 & 12 Month EMI on Amazon", "By : Amazon", "Valid Till : Till Dec 31", "Bank  : Kotak Mahindra Bank", "Deal Type: EMI", "Card Type: Credit", "OfferMessage: Avail this offer on every purchase on the Amazon store for All Kotak Mahindra Bank Credit Cards holders. The offer  is valid  till Dec 31. Book now!"], ["OfferName: Flipkart EMI Offer- 3, 6, 9, 12, 18 and 24 Months EMI on Flipkart", "By : Flipkart", "Valid Till : Till Dec 31", "Bank  : Kotak Mahindra Bank", "Deal Type: EMI", "Card Type: Credit", "OfferMessage: Avail this offer on every purchase on the Flipkart store for All Kotak Mahindra Bank Credit Cards holders. The offer  is valid  till Dec 31. Book now!"], ["OfferName: Avail Easy EMI on shopping on Flipkart", "By : Flipkart", "Valid Till : Sep 22 - Dec 31", "Bank  : Kotak Mahindra Bank", "Deal Type: EMI", "Card Type: Credit", "OfferMessage: Avail this offer on every purchase on the Flipkart store for All Kotak Mahindra Bank Credit Cards holders. The offer  is valid  from Sep 22 to Dec 31. Book now!"], ["OfferName: Avail Easy EMI & no Processing Fee on Amazon using Kotak Mahindra Bank Cards", "By : Amazon", "Valid Till : Sep 22 - Dec 31", "Bank  : Kotak Mahindra Bank", "Deal Type: EMI", "Card Type: Credit", "OfferMessage: Avail this offer on every purchase on the Amazon store for All Kotak Mahindra Bank Credit Cards holders. The offer  is valid  from Sep 22 to Dec 31. Hurry up and make use of this offer now!"], ["OfferName: Snapdeal EMI Offer - 3, 6, 9 & 12 Month EMI", "By : Snapdeal", "Valid Till : Till Dec 31", "Bank  : Kotak Mahindra Bank", "Deal Type: EMI", "Card Type: Credit", "OfferMessage: Avail this offer on every purchase on the Snapdeal store for All Kotak Mahindra Bank Credit Cards holders. The offer  is valid  till Dec 31. Book now!"], ["OfferName: Paytm EMI Offer - 3, 6, 9 & 12 Months EMI on Paytm", "By : Paytm", "Valid Till : Till Mar 31", "Bank  : Kotak Mahindra Bank", "Deal Type: EMI", "Card Type: Credit", "OfferMessage: Avail this offer on every purchase on the Paytm store for All Kotak Mahindra Bank Credit Cards holders. The offer  is valid  till Mar 31. Book now!"], ["OfferName: Yatra EMI Offer - 3, 6, 9 & 12 Month EMI", "By : Yatra", "Valid Till : Till Dec 31", "Bank  : Kotak Mahindra Bank", "Deal Type: EMI", "Card Type: Credit", "OfferMessage: Avail this offer on every purchase on the Yatra store for All Kotak Mahindra Bank Credit Cards holders. The offer  is valid  till Dec 31. Avail this offer now!"], ["OfferName: Bookmyshow EMI Offer - 3, 6, 9 & 12 Month EMI", "By : BookMyShow", "Valid Till : Till Dec 31", "Bank  : Kotak Mahindra Bank", "Deal Type: EMI", "Card Type: Credit", "OfferMessage: Avail this offer on every purchase on the BookMyShow store for All Kotak Mahindra Bank Credit Cards holders. The offer  is valid  till Dec 31. Hurry up and make use of this offer now!"], ["OfferName: Goibibo EMI Offer - 3, 6, 9 & 12 Month EMI on Goibibo", "By : Goibibo", "Valid Till : Till Dec 31", "Bank  : Kotak Mahindra Bank", "Deal Type: EMI", "Card Type: Credit", "OfferMessage: Avail this offer on every purchase on the Goibibo store for All Kotak Mahindra Bank Credit Cards holders. The offer  is valid  till Dec 31. Avail this offer now!"], ["OfferName: Avail Easy EMI & no Processing Fee on Goibibo using Kotak Mahindra Bank Cards", "By : Goibibo", "Valid Till : Sep 22 - Dec 31", "Bank  : Kotak Mahindra Bank", "Deal Type: EMI", "Card Type: Credit", "OfferMessage: Avail this offer on every purchase on the Goibibo store for All Kotak Mahindra Bank Credit Cards holders. The offer  is valid  from Sep 22 to Dec 31. Book now!"]]